/*
*┌──────────────────────────────────────────────────────────────┐
*│　描   述：单列接口                                                    
*│　作   者：xuXin                                              
*│　版   本：1.0.0                                                 
*│　创建时间：2019/3/18 15:08:40              
*└──────────────────────────────────────────────────────────────┘
*/

namespace SsitEngine
{
    /// <summary>
    ///     单列统一接口
    /// </summary>
    public interface ISingleton
    {
        /// <summary>
        ///     初始化方法
        /// </summary>
        void OnSingletonInit();
    }
}