/*
*┌──────────────────────────────────────────────────────────────┐
*│　描   述：属性信息接口                                                    
*│　作   者：xuXin                                              
*│　版   本：1.0.0                                                 
*│　创建时间：2019年4月9日                             
*└──────────────────────────────────────────────────────────────┘
*/

namespace SsitEngine.Data
{
    /// <summary>
    ///     属性信息接口
    /// </summary>
    public interface IInfoData
    {
        /// <summary>
        ///     数据ID
        /// </summary>
        string ID { get; }
    }
}