/*
*┌──────────────────────────────────────────────────────────────┐
*│　描   述：资源引用接口（判断资源可释放性）                                                    
*│　作   者：xuXin                                              
*│　版   本：1.0.0                                                 
*│　创建时间：2019/3/20 14:35:45                     
*└──────────────────────────────────────────────────────────────┘
*/

namespace SsitEngine.Core.ReferencePool
{
    /// <summary>
    ///     引用接口。
    /// </summary>
    public interface IReference
    {
        /// <summary>
        ///     清理引用。
        /// </summary>
        void Clear();
    }
}